; domain
; Source: https://github.com/AI-Planning/pddl-generators/tree/main/miconic
; Fix: prevent the elevator from boarding served passengers => (not (origin ?p ?f)) effect added to board action
(define (domain miconic)
  (:requirements :strips :typing)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (and (boarded ?p) (not (origin ?p ?f))))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
;; passengers=3, floors=8, out_folder=training/easy, instance_id=38, seed=65

(define (problem miconic-38)
 (:domain miconic)
 (:objects 
    p1 p2 p3 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 - floor
    )
 (:init 
    (lift-at f7)
    (origin p1 f5)
    (destin p1 f3)
    (origin p2 f4)
    (destin p2 f5)
    (origin p3 f8)
    (destin p3 f5)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f6 f7)
    (above f6 f8)
    (above f7 f8)
)
 (:goal  (and (served p1)
   (served p2)
   (served p3))))

; plan
1. (down f7 f4)
   deleted: (lift-at f7)
   added: (lift-at f4)
   goals met: 0 of 3
2. (board f4 p2)
   deleted: (origin p2 f4)
   added: (boarded p2)
   goals met: 0 of 3
3. (up f4 f8)
   deleted: (lift-at f4)
   added: (lift-at f8)
   goals met: 0 of 3
4. (board f8 p3)
   deleted: (origin p3 f8)
   added: (boarded p3)
   goals met: 0 of 3
5. (down f8 f5)
   deleted: (lift-at f8)
   added: (lift-at f5)
   goals met: 0 of 3
6. (board f5 p1)
   deleted: (origin p1 f5)
   added: (boarded p1)
   goals met: 0 of 3
7. (depart f5 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 1 of 3
8. (depart f5 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 2 of 3
9. (down f5 f3)
   deleted: (lift-at f5)
   added: (lift-at f3)
   goals met: 2 of 3
10. (depart f3 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 3 of 3
